In [1]:
import pandas as pd

Reading the dataset using .read_csv() in pandas and assiging to variable df.

In [79]:
df = pd.read_csv("parks.csv")

Checking the type of dataframe

In [10]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

Printing the number of rows and coloumns.

In [8]:
df.shape

(56, 6)

Knowing about the variables in our dataframe using ```dtypes```

In [23]:
df.dtypes

Park Code     object
Park Name     object
State         object
Acres          int64
Latitude     float64
Longitude    float64
dtype: object

Statistical Attributes for the dataset

In [9]:
df.describe()

              Acres   Latitude   Longitude
count  5.600000e+01  56.000000   56.000000
mean   9.279291e+05  41.233929 -113.234821
std    1.709258e+06  10.908831   22.440287
min    5.550000e+03  19.380000 -159.280000
25%    6.901050e+04  35.527500 -121.570000
50%    2.387645e+05  38.550000 -110.985000
75%    8.173602e+05  46.880000 -103.400000
max    8.323148e+06  67.780000  -68.210000

Peeking into first and last elements of the dataset using head and tail methods. Head and Tail methods gives first and last five tuples in the dataset.

In [13]:
df.head()

  Park Code               Park Name State   Acres  Latitude  Longitude
0      ACAD    Acadia National Park    ME   47390     44.35     -68.21
1      ARCH    Arches National Park    UT   76519     38.68    -109.57
2      BADL  Badlands National Park    SD  242756     43.75    -102.50
3      BIBE  Big Bend National Park    TX  801163     29.25    -103.25
4      BISC  Biscayne National Park    FL  172924     25.65     -80.08

In [14]:
df.tail()

,Park Code,Park Name,State,Acres,Latitude,Longitude
51,WICA,Wind Cave National Park,SD,28295,43.57,-103.48
52,WRST,Wrangell - St Elias National Park and Preserve,AK,8323148,61.00,-142.00
53,YELL,Yellowstone National Park,"WY, MT, ID",2219791,44.60,-110.50
54,YOSE,Yosemite National Park,CA,761266,37.83,-119.50
55,ZION,Zion National Park,UT,146598,37.30,-113.05

In [17]:
# Passing an number as an argument gives the same number of tuples paseed in.
df.head(3)

  Park Code               Park Name State   Acres  Latitude  Longitude
0      ACAD    Acadia National Park    ME   47390     44.35     -68.21
1      ARCH    Arches National Park    UT   76519     38.68    -109.57
2      BADL  Badlands National Park    SD  242756     43.75    -102.50

In [18]:
df.tail(8)

,Park Code,Park Name,State,Acres,Latitude,Longitude
48,SHEN,Shenandoah National Park,VA,199045,38.53,-78.35
49,THRO,Theodore Roosevelt National Park,ND,70447,46.97,-103.45
50,VOYA,Voyageurs National Park,MN,218200,48.50,-92.88
51,WICA,Wind Cave National Park,SD,28295,43.57,-103.48
52,WRST,Wrangell - St Elias National Park and Preserve,AK,8323148,61.00,-142.00
53,YELL,Yellowstone National Park,"WY, MT, ID",2219791,44.60,-110.50
54,YOSE,Yosemite National Park,CA,761266,37.83,-119.50
55,ZION,Zion National Park,UT,146598,37.30,-113.05

#### Indexing Rows
Accesing rows/tuples of dataframe using ```iloc()```

```iloc()``` method helps you to acces a single row, if you want to access multiple rows you can iterate over a for/while loop.

In [22]:
df.iloc[0]

Park Code                    ACAD
Park Name    Acadia National Park
State                          ME
Acres                       47390
Latitude                    44.35
Longitude                  -68.21
Name: 0, dtype: object

In [31]:
df.iloc[5]

Park Code                                          BLCA
Park Name    Black Canyon of the Gunnison National Park
State                                                CO
Acres                                             32950
Latitude                                          38.57
Longitude                                       -107.72
Name: 5, dtype: object

The other main approach is to pass a value from your dataframe's index to the .loc method:

In [40]:
# Accesing multiple tuples using iloc()
df.iloc[[2, 1, 0, 5, 6]]

,Park Code,Park Name,State,Acres,Latitude,Longitude
2,BADL,Badlands National Park,SD,242756,43.75,-102.50
1,ARCH,Arches National Park,UT,76519,38.68,-109.57
0,ACAD,Acadia National Park,ME,47390,44.35,-68.21
5,BLCA,Black Canyon of the Gunnison National Park,CO,32950,38.57,-107.72
6,BRCA,Bryce Canyon National Park,UT,35835,37.57,-112.18

In [46]:
# Recap, slicing using lists.
my_list = ['Mango', 'Apple', 'Grapes', 'Orange']
print(type(my_list))

<class 'list'>

In [47]:
# Accesing using passing the index. 
my_list[1]

'Apple'

In [52]:
# Slicing the list using ':'
# [start:end]
# Prints the until two elements.
my_list[:2]

['Mango', 'Apple']

In [55]:
# Prints the elements until starting from second index to end index.
my_list[2:]

['Grapes', 'Orange']

In [57]:
# Prints the elements starting with index 2 and ending with index 3.
my_list[2:3]

['Grapes']

#### Slicing the dataframe

In [59]:
# Prints the first 3 tuples of the dataframe
df[:3]

  Park Code               Park Name State   Acres  Latitude  Longitude
0      ACAD    Acadia National Park    ME   47390     44.35     -68.21
1      ARCH    Arches National Park    UT   76519     38.68    -109.57
2      BADL  Badlands National Park    SD  242756     43.75    -102.50

In [62]:
# Prints the tuples between 2 to 6 tuple index.
df[2:6]

,Park Code,Park Name,State,Acres,Latitude,Longitude
2,BADL,Badlands National Park,SD,242756,43.75,-102.50
3,BIBE,Big Bend National Park,TX,801163,29.25,-103.25
4,BISC,Biscayne National Park,FL,172924,25.65,-80.08
5,BLCA,Black Canyon of the Gunnison National Park,CO,32950,38.57,-107.72

#### Indexing Columns

In [63]:
df['Park Code']

0     ACAD
1     ARCH
2     BADL
3     BIBE
4     BISC
5     BLCA
6     BRCA
7     CANY
8     CARE
9     CAVE
10    CHIS
11    CONG
12    CRLA
13    CUVA
14    DENA
15    DEVA
16    DRTO
17    EVER
18    GAAR
19    GLAC
20    GLBA
21    GRBA
22    GRCA
23    GRSA
24    GRSM
25    GRTE
26    GUMO
27    HALE
28    HAVO
29    HOSP
30    ISRO
31    JOTR
32    KATM
33    KEFJ
34    KOVA
35    LACL
36    LAVO
37    MACA
38    MEVE
39    MORA
40    NOCA
41    OLYM
42    PEFO
43    PINN
44    REDW
45    ROMO
46    SAGU
47    SEKI
48    SHEN
49    THRO
50    VOYA
51    WICA
52    WRST
53    YELL
54    YOSE
55    ZION
Name: Park Code, dtype: object

In [64]:
df['State']

0             ME
1             UT
2             SD
3             TX
4             FL
5             CO
6             UT
7             UT
8             UT
9             NM
10            CA
11            SC
12            OR
13            OH
14            AK
15        CA, NV
16            FL
17            FL
18            AK
19            MT
20            AK
21            NV
22            AZ
23            CO
24        TN, NC
25            WY
26            TX
27            HI
28            HI
29            AR
30            MI
31            CA
32            AK
33            AK
34            AK
35            AK
36            CA
37            KY
38            CO
39            WA
40            WA
41            WA
42            AZ
43            CA
44            CA
45            CO
46            AZ
47            CA
48            VA
49            ND
50            MN
51            SD
52            AK
53    WY, MT, ID
54            CA
55            UT
Name: State, dtype: object

In [80]:
# Limiting the coloums using .head()
# Prints the first three states.
df['State'].head(3)

0    ME
1    UT
2    SD
Name: State, dtype: object

In [81]:
df['Latitude'].tail(5)

51    43.57
52    61.00
53    44.60
54    37.83
55    37.30
Name: Latitude, dtype: float64

Printing the attribute names or the first tuple of the dataframe

In [82]:
print(df.columns)

Index(['Park Code', 'Park Name', 'State', 'Acres', 'Latitude', 'Longitude'], dtype='object')

Renaming all the column names using ```.replace()``` and removing spaces in the names.

In [83]:
df.columns = [col.replace(' ', '_').lower() for col in df.columns]

In [84]:
print(df.columns)

Index(['park_code', 'park_name', 'state', 'acres', 'latitude', 'longitude'], dtype='object')

In [88]:
# Accesing the state and acres with renamed columns names.
df[['state', 'acres']][:5]

  state   acres
0    ME   47390
1    UT   76519
2    SD  242756
3    TX  801163
4    FL  172924